{
    "1": {
        "1.1": [
            "Welcome to the Touch Typing Course!",
            "Touch typing is a technique for typing quicker and more accurately by using all ten fingers without looking at the keys.",
            "The core idea is to learn the location of keys by muscle memory. This means your fingers will know where to go without your eyes guiding them.",
            "To begin, place your fingers on the 'Home Row' (A S D F and J K L ;). Your index fingers should rest on F and J."
        ],
        "1.2": "Place your fingers on the HOME ROW.\n\nLEFT HAND:\nLittle finger on A\nRing finger on S\nMiddle finger on D\nIndex finger on F\n\nRIGHT HAND:\nIndex finger on J\nMiddle finger on K\nRing finger on L\nLittle finger on ;",
        "1.3": "aaa sss ddd fff jjj kkk lll ;;;\nasdf jkl; asdf jkl;\na; sl dk fj a; sl dk fj\naa ss dd ff jj kk ll ;;\nfa da sa ja la ka;\nall dad sad fall;\naa ss dd ff jj kk ll ;;\nasdf jkl; asdf jkl;\nfjdksl a; fjdksl a;\nfff jjj ddd kkk sss lll aaa ;;;",
        "1.4": "ask dad lad fall flask lass sad all add as dad as salad salsa dad fall falls flask asks all dad sad add a dad ask a lad fall as a lad asks sad dad all fall lass asks dad all as fall dad sad lad asks flask falls as a sad lad salsa salad for dad and lass add all flask falls sad dad asks a lad for salad a sad dad falls for salad ask a flask for a fall all lads ask a dad fall as a sad lass falls a dad adds a salad ask as all fall sad a lass adds a salad a sad dad falls for a flask ask a lad for a fall all dads ask for a lad a flask falls as all fall sad as a lad asks dad all fall sad a dad adds a flask a lass falls ill a sad lad asks for a salad dad falls for a lass all flask falls sad a dad asks a lad fall as all fall sad dad adds a salad ask a lad for a flask all fall as a dad falls sad lass asks for a salad a flask falls for a lad add a salad for a dad all fall sad as a lad asks dad for a flask",
        "1.5": "ask dad for a lad; flask fall; a sad lass; a lad asks a dad; dad falls; a lass falls; all fall; ask a sad lad; dad asks a lass; all lad asks dad; a dad falls as all fall; a sad flask falls; a lad asks for salad; dad adds a flask; a sad lass falls as dad asks; all dad asks is a salad; flask for a lad is sad; fall dad as a lass asks; a lass adds a salad; a sad dad falls for a flask; ask a lad for a fall; all dads ask for a lad; a flask falls as all fall sad; a lad asks for a flask; dad falls for a salad; a sad lass asks a dad; all fall sad as a flask falls; a lad adds a salad; a dad asks for a flask; fall as a sad lad; ask dad for a salad; a flask falls for a lass; all lads ask for a dad; a sad fall for a dad; add a salad for a lass; a flask falls as dad falls; ask a lad for a dad; a sad lass falls for a salad; all fall as a lad asks; a dad adds a flask; ask for a salad; a lad falls for a dad; a sad flask falls sad;"
    },
    "2": {
        "2.1": "Reach for the top row.\n\nKey E: Use your LEFT MIDDLE finger. Reach up from D.\nKey I: Use your RIGHT MIDDLE finger. Reach up from K.\n\nKeep your other fingers on the home row while reaching.",
        "2.2": [
            "How long should you practice?",
            "For best results, practice in short bursts of 15-30 minutes daily. Consistency is more important than duration.",
            "Your brain needs sleep to consolidate muscle memory. So, daily practice with good rest is the secret formula for speed."
        ],
        "2.3": "ed ik ede iki see sea fee if is as idea keel lea led like lie did kid die side slide life file fill fell feel feed seed deed self desk ease else field sail fail jail leaf safe said seal seek sick silk slide sled skill ski ideals ideas idles isles files filled field side desks safe slide fell kids like sea life seeds feed seal life fail fed feel fell lead leaf leak led said sail sake sale",
        "2.4": "he is ill; she is like; i like it; if he falls; see a sea; a life is a deed; feel a seed; fill a file; dad is ill; a kid is a lad; he fed a lad; she did a deed; he said he is ill; she feels like a leaf; i see a safe field; fill the file with ideals; she said life is a field; he did fill the safe; a kid feels like a seed; see if the sea is safe; she likes a safe life; he fed the kid a seed; a sad dad feels ill; fill the safe with deeds; she said a kid is safe; he feels like a king; she said he is ill; a life is like a sail; fill the field with seeds; he said the sea is safe; she feels ill; i like the safe field; he did a deed; she fed the kid; life is a field; fill the file; a kid falls; he feels sad; see the sea; a safe life; she said he did it; i feel like a leaf; he led a kid; she fed a sad lad; life is filled with deeds; see if the ice is safe; he feels ill if he fails;",
        "2.5": [
            "What is the Typing Meter?",
            "The Typing Meter is a widget that tracks your typing in real-world applications. It analyzes your typing while you write emails, reports, or chat.",
            "It then identifies your 'Problem Keys' and suggests custom training lessons to fix them."
        ],
        "2.6": "he feels ill if he fails; she likes a sea side; life is like a slide; a kid fills a file; if a lad falls he feels sad; dad did a deed; see if she is ill; i feel like a seed; he led a life; she fed the seal a fish; the keel of the ski is safe; a silk sail is ideal; he fills the desk with files; she said the sea is deep; life feels like a sad slide; if he fails he feels ill; a safe field is ideal for a kid; he said he likes a safe life; she fed a seal a seed; a kid slides if ice is safe; fill a flask if he is ill; she said life is a deal; a sad aid is ill; he feels a like a leaf; if a kid falls he feels sad; see if the ski is safe; she fed the seal a fish; a life is filled with ills; if he fails he feels sad; she said the field is safe; he led a sad life; fill the file with deeds; a kid likes a safe slide; see if the sea is deep; she feels like a seed; he said he is safe; a sad lad feels ill; life is like a field; fill the desk with seeds; if he falls he feels sad; she said the ice is safe; a kid likes a sea slide; he feels ill if he is sad;"
    },
    "3": {
        "3.1": "Use your INDEX fingers for R and U.\n\nKey R: Reach up and left with your LEFT INDEX finger from F.\nKey U: Reach up and left with your RIGHT INDEX finger from J.",
        "3.2": "frf juj rur fur far red sue rue sure user real rule full dull lark dark earl lurk rare rear rude ruse urge usual rural ruler fraud freak fresh fuel fuse rush rust sail surf sure user safe dual duel duke dusk fur rug run real user sure rule read dear fear fuse rush full rare rear rude ruse dark earl uses fuel free full fur fuse real rear red reef safe said sail sake",
        "3.3": [
            "Ergonomics is key to preventing injury.",
            "1. Sit straight with your back supported. 2. Keep your feet flat on the floor.",
            "3. Your screen should be at eye level so you don't bend your neck. 4. Your elbows should be at a 90-degree angle.",
            "Most importantly: float your wrists above the keyboard. Do not rest them on the desk while typing, as this compresses the nerves."
        ],
        "3.4": "a fur rug; use a rule; sure is real; a full jar; a dark lark; she has a user; a real earl; hear us rule; use a full jar; she sure is rude; read a real rule; use a red rug; a user is sure; rush a full fuel truck; a duke has a rude rule; she uses a dual disk; the dark earl is sure; a rush for the fuel jar; he reads a rare rule; sure she is a real user; a full flask is safe; use a red sail for surf; a dark rule is rude; a real user is sure; she reads a full rule; hear the lark call; use a rude ruse; a red rug is safe; rush for the full jar; a dark earl is rude; she uses a dual rule; a sure user is safe; read the real rule; use a full fuel truck; a rare rug is safe; rush a rude duke; she hears a lark; a real rule is sure; use a dark jar; sure he is a user; a full sail is safe; read a rare ruse; a dual disk is used; rush the fuel truck; a rude earl is sure; she uses a red rug; a dark lark is real;",
        "3.5": "she has a red rug; he uses a full jar; sure he is a user; a real rule is dull; hear a lark; an earl has a fur; use a sure rule; run far if dark; she reads a dark rule; he fuels a red car; a user asks for a refund; surely a real earl is fair; run if you feel fear; a duke uses a rude ruse; the usual rush is dull; a rural ruler is sure; hear a dark lark call; she feels a rush of fear; a real user is safe here; read all rules for a safe ride; a full jar is safe; use a red car; sure he is a duke; a real rule is fair; hear a lark call; an earl uses a ruse; run if it is dark; she reads a full rule; he fuels a safe car; a user asks for a rule; surely a real duke is fair; run if you feel a rush; a duke uses a dark ruse; the usual rule is dull; a rural earl is sure; hear a rare lark; she feels a rush of air; a real user is sure; read all safe rules; a full car is safe; use a red jar; sure he is an earl; a real ruse is fair; hear a dark call; an earl uses a rule; run if the car is dark;",
        "3.6": [
            "Learning should be fun!",
            "Typing games are a great way to improve your speed and reaction time without feeling like 'work'.",
            "Try out the 'Bubbles' game to practice letter recognition, or 'WordTris' to practice typing common words under time pressure."
        ],
        "3.7": "rural ruler allure usual radar surfer lurker fraud freak fresh fuel fuse rush rust sail surf sure user safe dual duel duke dusk fur rug run real user sure rule read dear fear fuse rush full rare rear rude ruse dark fraud lurks near safe user reads rules real surfer rides rush rural area uses fuel a full rear rack is safe use a red lure for fish read a real rare rule list a rural ruler is real a surfer uses a lure a fraud lurks near a fresh fuel fuse a rush of rust a safe sail for a user a dual duel at dusk a fur rug is real a sure rule is read a dear fear of rush a rare rear ruse a dark fraud near a safe user reads a real surfer rides a rural area fuel a full rack is safe a red lure is real a rare rule list"
    },
    "4": {
        "4.1": "Extend your index and ring fingers for T and O.\n\nKey T: Reach up and right with your LEFT INDEX finger from F.\nKey O: Reach up and left with your RIGHT RING finger from L.",
        "4.2": "ftf lol tot too lot rot tool root fort just told took lost sort toss host most ghost toast roast coast boast float boat coat goat test rest east west forest frost trust trout store stork story storm short shoot shout scout outer route router tour totter tattoo tooth torso tort tool root toot tolled toll tomb tone outer router tour tore lost lot loud lout root rose rot route soft soil sold sole",
        "4.3": "too hot to trot; a lot of rot; lost a tool; just a root; old fort is lost; toss a toast; roast a goat; float a boat; coat is hot; ghost is lost; most host a toast; the store is short of salt; a storm is out east; shout at the scout; trust the route he took; a short story is told; the stork stood on a roof; trust the forest route; a lost ghost in the fort; the root of the tree is old; a soft soil for the rose; she sold a lot of tea; too soft to toss; a lot of lost tools; just a short trot; old ghost is lost; toss a hot toast; roast a fat goat; float a fast boat; coat is too hot; ghost is in the fort; most host a roast; the store is full of salt; a storm is near the coast; shout at the lost scout; trust the short route; a sad story is told; the stork stood on the fort; trust the sure route; a lost soul in the fort; the root is soft; a red rose in the soil; she sold a pot of tea;",
        "4.4": [
            "Track your progress!",
            "After each lesson, check the Statistics Dashboard. It gives you a detailed breakdown of your Net Speed (WPM) and Accuracy.",
            "Look for the 'Difficulty Index'. This tells you exactly which keys you are struggling with. If you see a red key, it means you need more practice on that specific letter."
        ],
        "4.5": "the old fort lost a root; too hot for a coat; just a lost ghost; roast a lot of toast; a goat on a boat; float to the coast; most lost a tool; toss the rot out; the host had a roast; the stork took a route south; trust a true scout; a forest store has a lot of food; the frost is cold on the road; a short shout from the scout; the story of the lost tool; a storm tore the roof off; the host told a sad story; a lot of lost souls at sea; trust the old root route; a soft rose for a lost soul; the heat is too hot; a lot of soft soot; just a short route; roast a fat goose; a goat ate the toast; float to the east coast; most took a tool; toss the old coat out; the host had a hot roast; the stork took a short route; trust a real scout; a forest full of food; the frost is hard on the road; a loud shout from the scout; the story of the old fort; a storm tore the sail; the host told a true story; a lot of souls at sea; trust the root of the tree; a red rose for a soul;",
        "4.6": "tattoo total tooth torso torts toolroot tootsie tootler tooter tortue tortil tosh toft told tole toll tolt tomb tome ton tone tong outer route router tour store stork story storm short shoot shout scout troop took tool tooth roast toast coast boast float boat goat coat root rose rot route took tool toot tore total loss of tools too hot tooot shoot shout short store stork storm outer route router tour toast roast coast boast float boat goat coat root rose rot route took tool toot tore"
    },
    "5": {
        "5.1": "Use the Shift key to type capital letters.\n\nUse the PINKY finger on the OPPOSITE hand of the letter you are typing.\nExample: To type 'A', hold RIGHT SHIFT with right pinky, strike 'A' with left pinky.",
        "5.2": "Dad Sad Lad Jack Joe Joel Jake Jeff Jolt Joss Jade Jar Jed Jet Jig Jost Judo Just Tell The Task To Tom Old Owls Often Oust Real Rats Run Races Fort Ford Fast Fats Sea Sail Salt Sand Ask All Add As Fall Flask Falls For Sad Salad Salsa Safe Dark Duke Deal Dear Read Real Red Rest Take Tall Task Tea Lose Lot Loud Love",
        "5.3": "Key Period (.): Use your RIGHT RING finger. Reach down from L.\n\nRemember to tap lightly and return to the home row immediately.",
        "5.4": "Jack acts. Dad is sad. A lad falls. Joe is lost. Jeff has a jet. Jade is red. A jar is full. Just do it. See the sea. Feel the air. Tom told Ted a tale. The tea is hot for Tod. Otis lost a shoe. The fort is old and lost. Real rats run fast. The old owl is sad. Just tell the truth. Sad dads ask for salad. A dark fort is safe. Take the tea to Ted. Just let Joe tell jokes. Ask Dad for a red sled. The jet is fast and loud. Jack sold a jar. Dad told a tale. A lad took a test. Joe lost a tool. Jeff has a job. Jade is safe. A jar of tea. Just take it. See the star. Feel the heat. Tom took a tour. The tea is for Ted. Otis told a joke. The fort is safe. Real rats run. The old owl flies. Just tell Joe. Sad lads ask for tea. A dark sea is safe. Take the tool to Tom. Just let Jeff tell tales. Ask Dad for a jet. The sled is fast.",
        "5.5": [
            "Rhythm is the secret to speed.",
            "Try to type with an even rhythm, like a steady drumbeat or a metronome.",
            "It is better to slow down and type steadily than to sprint through easy words and get stuck on hard ones. A steady pace reduces errors, and fewer errors ultimately means faster typing.",
            "Don't worry about speed for now. Focus on the rhythm."
        ],
        "5.6": "Jack falls. Dad is sad. A lad acts. Joe has a jet. Jeff is lost. Jade has a jar. A rut is full. Just a test. See a red sea. Feel a hot air. The old owl sat on a oak. A rat sat on the rug. Start the task at last. Trust the route to the fort. Tom told a sad tale. The tea is too hot. Otis took the tool. The store is just there. A real deal is rare. Joe lost the jet fuel. Just a tad of tea for Ted. A red rose for Jade. Start the race at last. Jack sat on a seat. Dad told a joke. A lad took a jet. Joe has a job. Jeff is safe. Jade has a jet. A rat is fat. Just a task. See the red star. Feel the sea air. The old owl ate a rat. A rat ran on the rug. Start the job at last. Trust the road to the fort. Tom told a tall tale. The tea is for Joe. Otis took the jet. The store is safe. A real deal is fair. Joe lost the red tool. Just a lot of tea for Ted. A red rose for Sue. Start the test at last.",
        "5.7": "Alaska. Dallas. Florida. Kansas. Seattle. Dakota. Detroit. Jordan. Israel. Russia. Sudan. Korea. Osaka. Tokio. Jakarta. Lhassa. Idaho. Ohio. Utah. Texas. Asia. Africa. Europe. Australia. Paris. Rome. London. Oslo. Delhi. Cairo. Lima. Peru. Jade. Jack. Joe. Jeff. Tom. Ted. Tod. Tess. Alaska is cold. Dallas is hot. Florida has sea. Kansas is flat. Seattle has rain. Dakota is far. Detroit has cars. Jordan is dry. Israel is old. Russia is vast. Sudan is hot. Korea is east. Osaka is loud. Tokio is fast. Jakarta is hot. Lhassa is high. Idaho has hills. Ohio is flat. Utah is red. Texas is big. Asia is vast. Africa is hot. Europe is old. Australia is far. Paris is fair. Rome is old. London is wet. Oslo is cold. Delhi is loud. Cairo is dry. Lima is high. Peru is south."
    },
    "6": {
        "6.1": "Reach down to the bottom row.\n\nKey C: Use your LEFT MIDDLE finger. Reach down from D.\nKey Comma (,): Use your RIGHT MIDDLE finger. Reach down from K.",
        "6.2": "call, cell, cast, cost, case, car, cat, cut, cute, code, cool, cold, cook, cock, clock, click, class, clash, crash, crush card, cart, care, face, fact, race, rack, rice, rich, rock, sack, sick, sock, such, tack crew, crop, crow, crud, cuff curd, cure, curl, curt, curse scare, scarf, scene, scent, school acid, acre, act, cute, core face, fact, fade, fail, fair",
        "6.3": "call a cab, I can see, sir, a cool cat, cut a cord, cook a crab, catch a cold, click a clock, crash a car, crush a can, class is cool the cat is cute, the car is fast, the clock is old, the cook is rich, a fact is true, a face is fair a rich rock star, a sick sack, a cold face, a cute case, cook some rice, race a car cut the cake, call the cook, a cute face, a cool case, cast a spell, catch a ball call a cop, I can sit, sir, a cold cat, cut a card, cook a fish, catch a ball, click a code, crash a jet, crush a rock, class is fair the cat is fast, the car is cool, the clock is set, the cook is sad, a fact is real, a face is soft a rich star, a sick cat, a cool face, a cute cat, cook a meal, race a jet cut the cord, call the cop, a cute cat, a cool car, cast a lot, catch a fish",
        "6.4": "A cool cat can call a cab. Sir, I can cook a crab. Catch a cold if ice is cold. Click a clock to see time. Crash a car if fast. Crush a can for cash. Class is a cool case. The cook cut the cake. The car cost cash. A cute cat is in the car. The race track is cold. Call the rich cook. A cold face is sad. Care for the sick cat. Cut the cord for the case. A cool class act is rare. The clock struck six. Catch the car if you can. A fast cat can catch a rat. Sir, I can cut a cake. Catch a fish if the lake is cold. Click a code to see the file. Crash a jet if slow. Crush a rock for ore. School is a cool place. The cook ate the cake. The car is fast. A red cat is in the car. The race is fast. Call the sick cook. A sad face is cold. Care for the old cat. Cut the cake for the class. A rich act is rare. The clock is fast. Catch the ball if you can.",
        "6.5": [
            "Check your posture again!",
            "It makes a big difference. As you get tired, it's easy to slouch. 1. Keep back straight. 2. Relax shoulders. 3. Elbows at 90 degrees.",
            "If you feel tension in your shoulders, take a deep breath and let them drop. Relaxed muscles move faster."
        ],
        "6.6": "cacao, cactus, cadet, caesar, cafe, cage, cake, calf, calif, calla, caller, calm, calorie, camel, camera, camp, canal, canary, cancel, cancer, candid, candle, candy, cane, canine, canoe, canon, cause, cease scoop, score, scorn, scour, scout scrap, screw, script, scroll, scrub scale, scalp, scare, scarf, school cacao trees grow fast, cactus needs sun, cadet is in class, caesar salad is good, cafe serves tea, cage the bird, cake is sweet, calf runs fast, calif rules the land, calla lily is white, caller is on line, calm sea is blue, calorie count is low, camel drinks water, camera takes photos, camp in the woods, canal is deep, canary sings loud, cancel the date, cancer is bad, candid photo is real, candle burns bright, candy is sweet, cane sugar is pure, canine teeth are sharp, canoe on the lake, canon law is old, cause of the fire, cease fire now scoop the ice cream, score a goal, scorn the bad, scour the pan, scout the area scrap the car, screw the bolt, script is long, scroll down the page, scrub the floor scale the wall, scalp is skin, scare the bird, scarf matches coat, school is open"
    },
    "7": {
        "7.1": "Learning the center keys.\n\nKey G: Reach right with your LEFT INDEX finger from F.\nKey H: Reach left with your RIGHT INDEX finger from J.",
        "7.2": "Key Apostrophe ('): Use your RIGHT PINKY. Reach right from Semicolon (;).",
        "7.3": "gas has hat had hog hug high sigh thigh fight light right might sight night tight dash hash gash lash sash girl, goal, goat, gold, good, half, hall, hand, hard, head, hear, heart, heat, heel, held, high, hill, hold, hole, home glad, glass, glide, glow, glue hair, hale, half, halt, hand that, this, though, thought, through stage, stare, start, state, such shag, shall, share, shark, she shed, sheet, shelf, shell, shift",
        "7.4": "he has a hat; she had a gas; a high sigh; fight the light; the right sight; might is right; hold the light tight; the girl had a goal; the goat ate the gold; he held a hard rock; a high hill is hot; hold the heat inside; the ghost had a glass; that girl is glad; of course he held it high; she thought it was gold; the light is right here; a gold ring for the girl; hold the door tight; hear the high hill call; he has a car; she had a cat; a high wall; fight the fire; the right way; might is strong; hold the rope tight; the girl had a doll; the goat ate the grass; he held a soft rock; a high roof is hot; hold the dog inside; the ghost had a sheet; that girl is sad; of course he held it low; she thought it was silver; the light is right there; a gold star for the boy; hold the gate tight; hear the high bird call;",
        "7.5": [
            "Don't forget to take breaks!",
            "Typing for long periods can cause Repetitive Strain Injury (RSI). We recommend the 20-20-20 rule: Every 20 minutes, look at something 20 feet away for 20 seconds.",
            "Also, stand up and stretch every hour to keep good blood flow."
        ],
        "7.6": "he had a hat on his head; she has a high gas bill; the light is too bright; hold the sash tight; a fight for the right sight; high lights are bright; a girl got a gold ring; the hall is high and hot; hear the laugh of the child; hold the dog tight; though the night is dark; glad to see the light; the goat is on the hill; hold the glass high; she has a good heart; hear the high shrill call; the girl held the goat; a hard fight for the gold; he had a cap on his head; she has a high tax bill; the light is too dim; hold the rope tight; a fight for the right way; high heels are tall; a girl got a silver ring; the hall is huge and cold; hear the cry of the child; hold the cat tight; though the day is dark; glad to see the sun; the cow is on the hill; hold the cup high; she has a kind heart; hear the high bird call; the girl held the cat; a hard race for the gold;",
        "7.7": "although, though, thought, through, highlight, headlight, flashlight, slaughter, laughter, daughter, frighten, lighten, tighten, brighten ghost, ghoul, giraffe, glass, globe, glove, glue, gnat, goal, goat, gold, golf right, rough, sight, slight, thigh shag, shake, shall, shame, shape although it rained we went, though he is old he is fast, thought he was right, through the dark woods, highlight the text, headlight is broken, flashlight is bright, slaughter the cow, laughter is loud, daughter is sweet, frighten the bird, lighten the load, tighten the screw, brighten the room ghost in the house, ghoul is scary, giraffe is tall, glass is clear, globe is round, glove fits well, glue sticks fast, gnat is small, goal is scored, goat eats grass, gold is shiny, golf is fun right to left, rough road ahead, sight is clear, slight chance of rain, thigh is sore shag rug is soft, shake the hand, shall we go, shame on you, shape the clay"
    },
    "8": {
        "8.1": "More bottom row keys.\n\nKey V: Reach down and right with LEFT INDEX finger.\nKey N: Reach down and left with RIGHT INDEX finger.",
        "8.2": "Key Question Mark (?): Use RIGHT PINKY + LEFT SHIFT. Reach down and right from Semicolon.",
        "8.3": "van vat vet vest vine vote void oven even seven never river over cover lover mover hover none nine noon noun name neat, near, neck, need, nest rain, ran, rang, rank, rant sang, sank, sane, save, scan vain, vale, vane, vase, vast nice, night, nine, noble, noise voice, void, volt, volume, vote never, new, news, nice, niche naval, nave, navel, near, neat",
        "8.4": "can i have a van? is it a vet? do not vote on it? have you seen a vine? a vest is on the vat? is seven ever even? cover the oven now? can nine men run? is the sun hot? did the van save the cat? scan the vast land? is the river near? can a nice nurse help? is the voice too loud? did you vote for him? never say never? have you seen the rain? is the vast valley green? did the nine men vote? can a vet save the dog? can i have a car? is it a pet? do not sit on it? have you seen a tree? a coat is on the rack? is eight ever odd? cover the pot now? can ten men run? is the fire hot? did the car save the dog? scan the high hill? is the lake near? can a good doctor help? is the song too loud? did you run for him? never say no? have you seen the sun? is the green valley vast? did the ten men run? can a doc save the cat?",
        "8.5": "can i have a vest? no, not ever. is the oven on? seven vines cover the river. have you seen a vote? never hover over a van. is it noon? the rain ran on the roof. a nurse can save a life. the vase is on the van. is the sun near? nine men ran to the van. a nice voice sang a song. the vast valley is green. never vote in vain. save the nice vase. the vet has a new van. can you hear the rain? the sun is hot at noon. nine nice nurses sang. a vast river runs near. can i have a coat? no, not now. is the stove on? eight vines cover the wall. have you seen a car? never run over a cat. is it night? the rain fell on the roof. a doctor can save a life. the cup is on the car. is the moon near? ten men ran to the car. a good voice sang a song. the green valley is deep. never run in vain. save the good cup. the doc has a new car. can you hear the wind? the sun is hot at one. ten good nurses sang. a deep river runs near.",
        "8.6": "invent, invest, invite, invoice, native, nature, naval, navel, nerve, never, niece, night, noise, none, noon, north, novel, novice, nurse vacant, vague, vain, valley, value, valve, vampire, van, vapor, variable, velvet vision, visit, visor, vista, visual invent a new machine, invest in stocks, invite a friend, invoice the client, native to the land, nature is beautiful, naval base is huge, navel orange is sweet, nerve is strong, never give up, niece is cute, night is dark, noise is loud, none is left, noon is lunch time, north pole is cold, novel is good, novice is new, nurse is kind vacant lot is empty, vague answer is bad, vain attempt failed, valley is deep, value is high, valve is open, vampire is scary, van is moving, vapor trail in sky, variable wind speed, velvet cake is red vision is clear, visit the sick, visor blocks sun, vista is wide, visual aid helps"
    },
    "9": {
        "9.1": "Key W: Use your LEFT RING finger. Reach up from S.\nKey M: Use your RIGHT INDEX finger. Reach down from J.",
        "9.2": "way was wet win wit who why how cow now vow wow maw mew mow mud mug mum sum hum gum swim warm worm swarm farm form make, male, mall, man, map mask, mass, mast, mate, math me, meal, mean, meat, meet wall, want, war, warm, warn wash, wasp, watch, water, wave mad, made, magic, maid, mail wait, wake, walk, wall, wand win, wind, wine, wing, wink",
        "9.3": "who won the war; how is the cow now; we will win wit; mow the wet mud; swim in the warm sea; a worm in the swarm; form a firm farm; make a meal with meat; the man has a map; watch the warm water; warn the men of war; meet me at the mall; wait for the warm wave; the magic man made a map; walk to the wall; wash the wet wool; make way for the man; who wants warm milk; the cow is in the mud; we will win the game; who lost the war; how is the dog now; we will win it; mow the dry grass; swim in the cold sea; a fly in the swarm; form a big farm; make a dish with meat; the boy has a map; watch the cold water; warn the boys of war; meet me at the shop; wait for the cold wave; the wise man made a map; walk to the door; wash the dry wool; make room for the man; who wants cold milk; the pig is in the mud; we will lose the game;",
        "9.4": "we want to win the war; how warm is the water; swim with the swarm; mow the mud on the farm; who will vow to win; a worm was in the mug; warm milk for mum; the wave hit the wall; make room for the man; wash the mud off the map; the wasp is on the mast; the women won the match; wait for the white wave; walk with me to the wall; a warm wind from the west; make a wish at the well; the man with the map is here; who made the warm meal; we walk in the wet mud; we want to win the game; how cold is the water; swim with the fish; mow the grass on the farm; who will try to win; a bug was in the cup; cold milk for dad; the boat hit the wall; make way for the car; wash the dirt off the map; the bird is on the mast; the men won the match; wait for the blue wave; walk with me to the door; a cold wind from the north; make a bet at the well; the boy with the map is here; who made the cold meal; we walk in the dry mud;",
        "9.5": "woman, women, won, wonder, wood, wool, word, work, world, worm, worry, worse, worship, worst, worth, would, wound, wrap, wreck, wrist, write, wrong mad, made, magic, maid, mail, main, major, make, male, mama, manage, mane, mania, many marsh, mart, mash, mask, mass woman is strong, women are wise, won the lottery, wonder of the world, wood for the fire, wool sweater is warm, word of mouth, work hard play hard, world is round, worm in the apple, worry about nothing, worse than before, worship the sun, worst day ever, worth a lot, would you go, wound heals fast, wrap the gift, wreck the car, wrist watch is gold, write a letter, wrong answer is bad mad at the world, made a cake, magic trick is cool, maid cleans house, mail the letter, main street is busy, major problem solved, make a wish, male lion roars, mama bear protects, manage the team, mane is long, mania is crazy, many people came marsh is wet, mart is open, mash the potato, mask covers face, mass meeting held"
    },
    "10": {
        "10.1": "Reaching the corners.\n\nKey Q: Use your LEFT PINKY. Reach up from A.\nKey P: Use your RIGHT PINKY. Reach up from Semicolon (;).",
        "10.2": "quit queen quick quiet quite quote pay pat pet pen pit pot pan pin pun pup pop pap pipe pope point paint plant plane plate place pass, past, path, peak, pear pack, page, pair, palm, park queen, quest, queue, quick, quiet quilt, quite, quote, quota peace, peach, peak, peal, pear pearl, peasant, pebble, peck, pedal quack, quad, quail, quake, qualm pack, pact, pad, page, paid",
        "10.3": "quit the quick game; pay the queen a pen; quiet peace in the place; plant a pine on the plane; quote the pope quite well; point to the plate; paint the pot pink; pass the pear to pat; the path is past the park; a page of a poem; the queen has a quest; she is quite quiet; pack a pair of pants; a quick peck on the peak; the poor peasant paid; plant a peach pit; the queen paid the price; a quiet pine park; put the pen on the page; pass the plate please; quit the slow game; pay the king a pen; loud war in the place; plant a rose on the plane; quote the man quite well; point to the cup; paint the pan red; pass the apple to pat; the road is past the park; a line of a poem; the king has a quest; he is quite loud; pack a set of pants; a quick kiss on the peak; the rich peasant paid; plant a plum pit; the king paid the price; a loud pine park; put the ink on the page; pass the dish please;",
        "10.4": "please pay the queen; a quick quiet quote; plant a pink pine; point to the paint; the pope has a plane; put the pen in the pot; quite a place to quit; pack a pair of pants; park the plane at the peak; the quest for the quill; quote the price of the quilt; a quiet path to the park; pay the poor man a penny; the quick queen quit; a peaceful place to paint; plant purple peas in the pot; the pope paid for the peace; a quick quote from the queen; please pass the pepper pot; please pay the king; a quick loud quote; plant a red pine; point to the wall; the king has a plane; put the ink in the pot; quite a time to quit; pack a bag of pants; park the car at the peak; the quest for the pen; quote the cost of the quilt; a loud path to the park; pay the rich man a dime; the fast queen quit; a loud place to paint; plant green peas in the pot; the king paid for the war; a fast quote from the king; please pass the salt pot;",
        "10.5": "packet, page, pail, pain, paint, pair, palace, pale, palm, pan, panel, panic, papa, paper, parade, parcel, pardon, parent, park, parlor, part, party, pass quack, quad, quail, quake, qualm, quart, quartz, queen, queer, quest, quick, quiet, quilt quota, quote, quotient packet of chips, page in book, pail of water, pain in neck, paint the wall, pair of shoes, palace is huge, pale face is white, palm reading is fun, pan is hot, panel discussion held, panic attack is bad, papa bear is big, paper plane flies, parade is long, parcel post is slow, pardon me please, parent trap is funny, park the car, parlor game is fun, part of the team, party is over, pass the ball quack goes the duck, quad bike ride, quail hunt is on, quake shakes ground, qualm about it, quart of milk, quartz watch is nice, queen rules land, queer eye for guy, quest for gold, quick brown fox, quiet please now, quilt is warm quota is met, quote the raven, quotient is result"
    },
    "11": {
        "11.1": "Key B: Reach down and right with LEFT INDEX finger.\nKey Y: Reach up and left with RIGHT INDEX finger.",
        "11.2": "bad bag bat bed beg bet bid big bit bog box boy buy by bye yes yet you any boy buy by bye my year yard yell yellow yes baby, back, ball, band, bank base, bath, bean, bear, beat yarn, yawn, year, yeast, yell yield, yoke, yolk, you, young bake, bald, bale, ball, balm yard, yarn, yawn, year, yeast baby, back, bad, bag, bail",
        "11.3": "buy a bag for the boy; yes you can bet on it; a big yellow box; by the year in the yard; say yes to the boy; bye bye baby boy; a bit of a big bag; The baby has a ball; The band played in the bank; The bear ate the bean; A young boy can yell; bake a big batch of buns; the yellow yolk is bright; you better be back by noon; a bad boy broke the bat; buy a blue bag for the baby; yes, the year is young; you bet the big boy won; yell at the yellow dog; a big bad bear in the box; buy a hat for the boy; no you can bet on it; a small yellow box; by the day in the yard; say no to the boy; bye bye big boy; a lot of a big bag; The boy has a ball; The band played in the park; The dog ate the bean; A big boy can yell; bake a small batch of buns; the white yolk is bright; you better be home by noon; a good boy broke the bat; buy a red bag for the baby; no, the year is old; you bet the small boy won; yell at the black dog; a small good bear in the box;",
        "11.4": "the boy has a big bag; yes, buy the yellow box; you can bet on the year; say bye to the bad boy; in the yard by the bay; yet you say yes; The base of the bank is big; The bear beat the boy to the berry; You are young yet; A yellow yolk is in the pan; the baby boy is big; a bad bat broke the ball; year by year you grow; buy a bit of yarn; the yellow bus is back; bring the big bag back; you are the best boy; a big bank robbery; yell if you see the bear; the girl has a big bag; no, buy the red box; you can bet on the day; say hi to the bad boy; in the house by the bay; yet you say no; The roof of the bank is big; The dog beat the boy to the berry; You are old yet; A white yolk is in the pan; the big boy is big; a good bat broke the ball; day by day you grow; buy a lot of yarn; the red bus is back; bring the small bag back; you are the worst boy; a small bank robbery; yell if you see the dog;",
        "11.5": "baby, back, bad, bag, bake, balance, ball, band, bang, bank, bar, barber, bare, bark, barn, barrel, base, basin, basket, bath, battle, bay, beach, beak yacht, yard, yarn, yawn, year, yeast, yell, yellow, yes, yet, yield, yoga, yogurt, yolk, you beauty, became, because, become baby cries loud, back to school, bad dog sit, bag of chips, bake a cake, balance the books, ball is round, band plays music, bang the drum, bank is open, bar of soap, barber cuts hair, bare feet walk, bark at moon, barn is red, barrel of monkeys, base is safe, basin is full, basket of fruit, bath is warm, battle is won, bay leaf in soup, beach is sandy, beak of bird yacht is white, yard sale today, yarn is soft, yawn is tired, year is new, yeast makes bread, yell at ref, yellow sun shines, yes I can, yet to come, yield to car, yoga is calm, yogurt is good, yolk is yellow, you are nice beauty is deep, became a star, because of you, become a pro"
    },
    "12": {
        "12.1": "Key Z: Use your LEFT PINKY. Reach down from A.\nKey X: Use your LEFT RING finger. Reach down from S.",
        "12.2": "aza sxs aza sxs zap zag zip zoo ax ex ox six fix mix fox box wax lax tax sex text next zero zone size seize breeze zebra, zinc, zone, zoom, zest exact, exam, exit, extra, taxi text, next, flux, flex, hoax axe, axis, axle, exam, exit zany, zeal, zebra, zenith, zero tax, tea, tex, text, time",
        "12.3": "fix the box at six; the fox is in the zoo; a size zero zone; seize the ax now; relax next to the box; mix the wax for the car; The zebra is in the zone; Zoom the camera to the fox; Exit the taxi next to the zoo; The exam was exact and extra hard; Fix the fax machine; The text was exact; Six zebras zigzagged; Relax, the exam is over; A fox in a box is safe; Mix the six packs of wax; The taxi exit is next; Zoom in on the zone; zero tolerance for zealots; fix the car at six; the dog is in the zoo; a size ten zone; seize the pen now; relax by the box; mix the oil for the car; The horse is in the zone; Zoom the lens to the fox; Exit the bus next to the zoo; The test was exact and extra hard; Fix the copy machine; The note was exact; Six horses zigzagged; Relax, the test is over; A cat in a box is safe; Mix the ten packs of wax; The bus exit is next; Zoom out on the zone; zero tolerance for bigots;",
        "12.4": "the fox was in a box; fix the lock at six; the zoo has a big size; seize the day next year; relax in the zone; a breeze in the trees; A zebra zagged by the zoo; The taxi exit was blocked by a box; Mix the text with the next page; Size zero is extra small; The extra tax is unfair; A wax box for the fax; Zero foxes in the zoo; Zip the bag and exit; Fix the six big leaks; Relax and take a nap; The exam text was hazy; Next time take a taxi; A crazy zebra in the zoo; Extra wax for the car; the cat was in a box; fix the door at six; the park has a big size; seize the hour next year; relax in the park; a wind in the trees; A horse zagged by the zoo; The bus exit was blocked by a box; Mix the note with the next page; Size ten is extra small; The extra fee is unfair; A wood box for the fax; Zero dogs in the zoo; Zip the coat and exit; Fix the ten big leaks; Relax and take a break; The test text was hazy; Next time take a bus; A crazy horse in the zoo; Extra oil for the car;",
        "12.5": [
            "Testing your skills.",
            "Regular typing tests help measure your progress. However, don't just focus on speed.",
            "Accuracy is the foundation of speed. If you type fast but make many errors, you will spend more time correcting them than typing.",
            "Aim for 98% accuracy or higher. Speed will naturally follow."
        ],
        "12.6": "exact, exam, example, excel, excellent, except, excess, excite, excuse, execute, exercise, exert, exist, exit, expand, expect, expense, expert, expire, explain zany, zeal, zebra, zenith, zero, zest, zigzag, zinc, zipper, zone, zoo, zoology, zoom sex, six, tax, text, vex exact change please, exam is today, example is good, excel at sports, excellent work done, except for you, excess baggage fee, excite the crowd, excuse me sir, execute the plan, exercise is good, exert the force, exist in peace, exit stage left, expand the mind, expect the best, expense report due, expert witness called, expire next month, explain the rule zany comedy show, zeal for life, zebra has stripes, zenith of career, zero gravity room, zest for cooking, zigzag down road, zinc oxide cream, zipper is stuck, zone out now, zoo is fun, zoology degree earned, zoom in close sex education class, six pack abs, tax return filed, text message sent, vex the king",
        "12.7": [
            "Congratulations! You have completed the basic course.",
            "You have learned all the alphabet keys and basic punctuation.",
            "So, what is next? 1. Continue practicing to build speed. 2. Learn the number row. 3. Master the special symbols. 4. Try the advanced speed building courses."
        ]
    }
}